//---------------------------------------------------------------------------
#ifndef clObjectH
#define clObjectH
//---------------------------------------------------------------------------
class clObject
{
/*закрытые функции-члены и данные-члены
недоступны за пределами класса*/
private:
	//данные-члены
	//"set" функции-члены
	//"get" функции-члены
	//другие функции-члены

/*защищенные функции-члены и данные-члены
доступны в производном классе*/
protected:
	//данные-члены
	//"set" функции-члены
	//"get" функции-члены   
	//другие функции-члены

/*открытые функции-члены и данные-члены
доступны везде*/
public:
	//деструктор и конструкторы
	//данные-члены
	//"set" функции-члены
	//"get" функции-члены
	//другие функции-члены	
};
//---------------------------------------------------------------------------
#endif